iNavFlight/inav/lib/main/STM32H7/Drivers/CMSIS/ARM.CMSIS.pdsc
    <condition id="ARMv7-A Device">
      <description>Armv7-A architecture based device</description>
      <accept Dcore="Cortex-A5"/>
      <accept Dcore="Cortex-A7"/>
      <accept Dcore="Cortex-A9"/>
    </condition>

    <!-- ARM core -->
    <condition id="CM0">
      <description>Cortex-M0 or Cortex-M0+ or SC000 processor based device</description>
      <accept Dcore="Cortex-M0"/>
      <accept Dcore="Cortex-M0+"/>
      <accept Dcore="SC000"/>
    </condition>
    <condition id="CM1">
      <description>Cortex-M1</description>
      <require Dcore="Cortex-M1"/>
    </condition>
    <condition id="CM3">
      <description>Cortex-M3 or SC300 processor based device</description>
      <accept Dcore="Cortex-M3"/>
      <accept Dcore="SC300"/>
    </condition>
    <condition id="CM4">
      <description>Cortex-M4 processor based device</description>
      <require Dcore="Cortex-M4" Dfpu="NO_FPU"/>
    </condition>
    <condition id="CM4_FP">
      <description>Cortex-M4 processor based device using Floating Point Unit</description>
      <accept Dcore="Cortex-M4" Dfpu="FPU"/>
      <accept Dcore="Cortex-M4" Dfpu="SP_FPU"/>
      <accept Dcore="Cortex-M4" Dfpu="DP_FPU"/>
    </condition>
    <condition id="CM7">
      <description>Cortex-M7 processor based device</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU"/>
    </condition>
    <condition id="CM7_FP">
      <description>Cortex-M7 processor based device using Floating Point Unit</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU"/>
    </condition>
    <condition id="CM7_SP">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP)</description>
      <require Dcore="Cortex-M7" Dfpu="SP_FPU"/>
    </condition>
    <condition id="CM7_DP">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP)</description>
      <require Dcore="Cortex-M7" Dfpu="DP_FPU"/>
    </condition>
    <condition id="CM23">
      <description>Cortex-M23 processor based device</description>
      <require Dcore="Cortex-M23"/>
    </condition>
    <condition id="CM33">
      <description>Cortex-M33 processor based device</description>
      <require Dcore="Cortex-M33" Dfpu="NO_FPU"/>
    </condition>
    <condition id="CM33_FP">
      <description>Cortex-M33 processor based device using Floating Point Unit</description>
      <require Dcore="Cortex-M33" Dfpu="SP_FPU"/>
    </condition>
    <condition id="CM35P">
      <description>Cortex-M35P processor based device</description>
      <require Dcore="Cortex-M35P" Dfpu="NO_FPU"/>
    </condition>
    <condition id="CM35P_FP">
      <description>Cortex-M35P processor based device using Floating Point Unit</description>
      <require Dcore="Cortex-M35P" Dfpu="SP_FPU"/>
    </condition>
    <condition id="ARMv8MBL">
      <description>Armv8-M Baseline processor based device</description>
      <require Dcore="ARMV8MBL"/>
    </condition>
    <condition id="ARMv8MML">
      <description>Armv8-M Mainline processor based device</description>
      <require Dcore="ARMV8MML" Dfpu="NO_FPU"/>
    </condition>
    <condition id="ARMv8MML_FP">
      <description>Armv8-M Mainline processor based device using Floating Point Unit</description>
      <accept Dcore="ARMV8MML" Dfpu="SP_FPU"/>
      <accept Dcore="ARMV8MML" Dfpu="DP_FPU"/>
    </condition>

    <condition id="CM33_NODSP_NOFPU">
      <description>CM33, no DSP, no FPU</description>
      <require Dcore="Cortex-M33" Ddsp="NO_DSP" Dfpu="NO_FPU"/>
    </condition>
    <condition id="CM33_DSP_NOFPU">
      <description>CM33, DSP, no FPU</description>
      <require Dcore="Cortex-M33" Ddsp="DSP" Dfpu="NO_FPU"/>
    </condition>
    <condition id="CM33_NODSP_SP">
      <description>CM33, no DSP, SP FPU</description>
      <require Dcore="Cortex-M33" Ddsp="NO_DSP" Dfpu="SP_FPU"/>
    </condition>
    <condition id="CM33_DSP_SP">
      <description>CM33, DSP, SP FPU</description>
      <require Dcore="Cortex-M33" Ddsp="DSP" Dfpu="SP_FPU"/>
    </condition>

    <condition id="CM35P_NODSP_NOFPU">
      <description>CM35P, no DSP, no FPU</description>
      <require Dcore="Cortex-M35P" Ddsp="NO_DSP" Dfpu="NO_FPU"/>
    </condition>
    <condition id="CM35P_DSP_NOFPU">
      <description>CM35P, DSP, no FPU</description>
      <require Dcore="Cortex-M35P" Ddsp="DSP" Dfpu="NO_FPU"/>
    </condition>
    <condition id="CM35P_NODSP_SP">
      <description>CM35P, no DSP, SP FPU</description>
      <require Dcore="Cortex-M35P" Ddsp="NO_DSP" Dfpu="SP_FPU"/>
    </condition>
    <condition id="CM35P_DSP_SP">
      <description>CM35P, DSP, SP FPU</description>
      <require Dcore="Cortex-M35P" Ddsp="DSP" Dfpu="SP_FPU"/>
    </condition>

    <condition id="ARMv8MML_NODSP_NOFPU">
      <description>Armv8-M Mainline, no DSP, no FPU</description>
      <require Dcore="ARMV8MML" Ddsp="NO_DSP" Dfpu="NO_FPU"/>
    </condition>
    <condition id="ARMv8MML_DSP_NOFPU">
      <description>Armv8-M Mainline, DSP, no FPU</description>
      <require Dcore="ARMV8MML" Ddsp="DSP" Dfpu="NO_FPU"/>
    </condition>
    <condition id="ARMv8MML_NODSP_SP">
      <description>Armv8-M Mainline, no DSP, SP FPU</description>
      <require Dcore="ARMV8MML" Ddsp="NO_DSP" Dfpu="SP_FPU"/>
    </condition>
    <condition id="ARMv8MML_DSP_SP">
      <description>Armv8-M Mainline, DSP, SP FPU</description>
      <require Dcore="ARMV8MML" Ddsp="DSP" Dfpu="SP_FPU"/>
    </condition>

    <condition id="CA5_CA9">
      <description>Cortex-A5 or Cortex-A9 processor based device</description>
      <accept Dcore="Cortex-A5"/>
      <accept Dcore="Cortex-A9"/>
    </condition>

    <condition id="CA7">
      <description>Cortex-A7 processor based device</description>
      <accept Dcore="Cortex-A7"/>
    </condition>

    <!-- ARMCC compiler -->
    <condition id="CA_ARMCC5">
      <description>Cortex-A5, Cortex-A7 or Cortex-A9 processor based device for the Arm Compiler 5</description>
      <require condition="ARMv7-A Device"/>
      <require condition="ARMCC5"/>
    </condition>
    <condition id="CA_ARMCC6">
      <description>Cortex-A5, Cortex-A7 or Cortex-A9 processor based device for the Arm Compiler 6</description>
      <require condition="ARMv7-A Device"/>
      <require condition="ARMCC6"/>
    </condition>

    <condition id="CM0_ARMCC">
      <description>Cortex-M0 or Cortex-M0+ or SC000 processor based device for the Arm Compiler</description>
      <require condition="CM0"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM0_LE_ARMCC">
      <description>Cortex-M0 or Cortex-M0+ or SC000 processor based device in little endian mode for the Arm Compiler</description>
      <require condition="CM0_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM0_BE_ARMCC">
      <description>Cortex-M0 or Cortex-M0+ or SC000 processor based device in big endian mode for the Arm Compiler</description>
      <require condition="CM0_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

