iNavFlight/inav/lib/main/STM32H7/Drivers/CMSIS/ARM.CMSIS.pdsc
    <condition id="CM1_ARMCC">
      <description>Cortex-M1 based device for the Arm Compiler</description>
      <require condition="CM1"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM1_LE_ARMCC">
      <description>Cortex-M1 based device in little endian mode for the Arm Compiler</description>
      <require condition="CM1_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM1_BE_ARMCC">
      <description>Cortex-M1 based device in big endian mode for the Arm Compiler</description>
      <require condition="CM1_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM3_ARMCC">
      <description>Cortex-M3 or SC300 processor based device for the Arm Compiler</description>
      <require condition="CM3"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM3_LE_ARMCC">
      <description>Cortex-M3 or SC300 processor based device in little endian mode for the Arm Compiler</description>
      <require condition="CM3_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM3_BE_ARMCC">
      <description>Cortex-M3 or SC300 processor based device in big endian mode for the Arm Compiler</description>
      <require condition="CM3_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM4_ARMCC">
      <description>Cortex-M4 processor based device for the Arm Compiler</description>
      <require condition="CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM4_LE_ARMCC">
      <description>Cortex-M4 processor based device in little endian mode for the Arm Compiler</description>
      <require condition="CM4_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM4_BE_ARMCC">
      <description>Cortex-M4 processor based device in big endian mode for the Arm Compiler</description>
      <require condition="CM4_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM4_FP_ARMCC">
      <description>Cortex-M4 processor based device using Floating Point Unit for the Arm Compiler</description>
      <require condition="CM4_FP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM4_FP_LE_ARMCC">
      <description>Cortex-M4 processor based device using Floating Point Unit in little endian mode for the Arm Compiler</description>
      <require condition="CM4_FP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM4_FP_BE_ARMCC">
      <description>Cortex-M4 processor based device using Floating Point Unit in big endian mode for the Arm Compiler</description>
      <require condition="CM4_FP_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_ARMCC">
      <description>Cortex-M7 processor based device for the Arm Compiler</description>
      <require condition="CM7"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7_LE_ARMCC">
      <description>Cortex-M7 processor based device in little endian mode for the Arm Compiler</description>
      <require condition="CM7_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_BE_ARMCC">
      <description>Cortex-M7 processor based device in big endian mode for the Arm Compiler</description>
      <require condition="CM7_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_FP_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit for the Arm Compiler</description>
      <require condition="CM7_FP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7_FP_LE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the Arm Compiler</description>
      <require condition="CM7_FP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_FP_BE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in big endian mode for the Arm Compiler</description>
      <require condition="CM7_FP_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_SP_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) for the Arm Compiler</description>
      <require condition="CM7_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7_SP_LE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) in little endian mode for the Arm Compiler</description>
      <require condition="CM7_SP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_SP_BE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) in big endian mode for the Arm Compiler</description>
      <require condition="CM7_SP_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_DP_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) for the Arm Compiler</description>
      <require condition="CM7_DP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7_DP_LE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) in little endian mode for the Arm Compiler</description>
      <require condition="CM7_DP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_DP_BE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) in big endian mode for the Arm Compiler</description>
      <require condition="CM7_DP_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM23_ARMCC">
      <description>Cortex-M23 processor based device for the Arm Compiler</description>
      <require condition="CM23"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM23_LE_ARMCC">
      <description>Cortex-M23 processor based device in little endian mode for the Arm Compiler</description>
      <require condition="CM23_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="CM33_ARMCC">
      <description>Cortex-M33 processor based device for the Arm Compiler</description>
      <require condition="CM33"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_LE_ARMCC">
      <description>Cortex-M33 processor based device in little endian mode for the Arm Compiler</description>
      <require condition="CM33_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>

