iNavFlight/inav/lib/main/STM32H7/Drivers/CMSIS/ARM.CMSIS.pdsc
    <condition id="ARMv8MML_FP_ARMCC">
      <description>Armv8-M Mainline processor based device using Floating Point Unit for the Arm Compiler</description>
      <require condition="ARMv8MML_FP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MML_FP_LE_ARMCC">
      <description>Armv8-M Mainline processor based device using Floating Point Unit in little endian mode for the Arm Compiler</description>
      <require condition="ARMv8MML_FP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="ARMv8MML_NODSP_NOFPU_ARMCC">
      <description>Armv8-M Mainline, no DSP, no FPU, Arm Compiler</description>
      <require condition="ARMv8MML_NODSP_NOFPU"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MML_DSP_NOFPU_ARMCC">
      <description>Armv8-M Mainline, DSP, no FPU, Arm Compiler</description>
      <require condition="ARMv8MML_DSP_NOFPU"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MML_NODSP_SP_ARMCC">
      <description>Armv8-M Mainline, no DSP, SP FPU, Arm Compiler</description>
      <require condition="ARMv8MML_NODSP_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MML_DSP_SP_ARMCC">
      <description>Armv8-M Mainline, DSP, SP FPU, Arm Compiler</description>
      <require condition="ARMv8MML_DSP_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ARMv8MML_NODSP_NOFPU_LE_ARMCC">
      <description>Armv8-M Mainline, little endian, no DSP, no FPU, Arm Compiler</description>
      <require condition="ARMv8MML_NODSP_NOFPU_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_DSP_NOFPU_LE_ARMCC">
      <description>Armv8-M Mainline, little endian, DSP, no FPU, Arm Compiler</description>
      <require condition="ARMv8MML_DSP_NOFPU_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_NODSP_SP_LE_ARMCC">
      <description>Armv8-M Mainline, little endian, no DSP, SP FPU, Arm Compiler</description>
      <require condition="ARMv8MML_NODSP_SP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_DSP_SP_LE_ARMCC">
      <description>Armv8-M Mainline, little endian, DSP, SP FPU, Arm Compiler</description>
      <require condition="ARMv8MML_DSP_SP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    
    <!-- GCC compiler -->
    <condition id="CA_GCC">
      <description>Cortex-A5, Cortex-A7 or Cortex-A9 processor based device for the GCC Compiler</description>
      <require condition="ARMv7-A Device"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="CM0_GCC">
      <description>Cortex-M0 or Cortex-M0+ or SC000 processor based device for the GCC Compiler</description>
      <require condition="CM0"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM0_LE_GCC">
      <description>Cortex-M0 or Cortex-M0+ or SC000 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM0_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM0_BE_GCC">
      <description>Cortex-M0 or Cortex-M0+ or SC000 processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM0_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM1_GCC">
      <description>Cortex-M1 based device for the GCC Compiler</description>
      <require condition="CM1"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM1_LE_GCC">
      <description>Cortex-M1 based device in little endian mode for the GCC Compiler</description>
      <require condition="CM1_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM1_BE_GCC">
      <description>Cortex-M1 based device in big endian mode for the GCC Compiler</description>
      <require condition="CM1_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM3_GCC">
      <description>Cortex-M3 or SC300 processor based device for the GCC Compiler</description>
      <require condition="CM3"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM3_LE_GCC">
      <description>Cortex-M3 or SC300 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM3_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM3_BE_GCC">
      <description>Cortex-M3 or SC300 processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM3_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM4_GCC">
      <description>Cortex-M4 processor based device for the GCC Compiler</description>
      <require condition="CM4"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM4_LE_GCC">
      <description>Cortex-M4 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM4_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM4_BE_GCC">
      <description>Cortex-M4 processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM4_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM4_FP_GCC">
      <description>Cortex-M4 processor based device using Floating Point Unit for the GCC Compiler</description>
      <require condition="CM4_FP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM4_FP_LE_GCC">
      <description>Cortex-M4 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <require condition="CM4_FP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM4_FP_BE_GCC">
      <description>Cortex-M4 processor based device using Floating Point Unit in big endian mode for the GCC Compiler</description>
      <require condition="CM4_FP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_GCC">
      <description>Cortex-M7 processor based device for the GCC Compiler</description>
      <require condition="CM7"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_LE_GCC">
      <description>Cortex-M7 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM7_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_BE_GCC">
      <description>Cortex-M7 processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM7_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_FP_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit for the GCC Compiler</description>
      <require condition="CM7_FP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_FP_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <require condition="CM7_FP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_FP_BE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in big endian mode for the GCC Compiler</description>
      <require condition="CM7_FP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_SP_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) for the GCC Compiler</description>
      <require condition="CM7_SP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_SP_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) in little endian mode for the GCC Compiler</description>
      <require condition="CM7_SP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="CM7_DP_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) for the GCC Compiler</description>
      <require condition="CM7_DP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_DP_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) in little endian mode for the GCC Compiler</description>
      <require condition="CM7_DP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="CM23_GCC">
      <description>Cortex-M23 processor based device for the GCC Compiler</description>
      <require condition="CM23"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM23_LE_GCC">
      <description>Cortex-M23 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM23_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>

