iNavFlight/inav/lib/main/STM32H7/Drivers/CMSIS/ARM.CMSIS.pdsc
    <condition id="CM33_NODSP_SP_LE_IAR">
      <description>CM33, little endian, no DSP, SP FPU, IAR Compiler</description>
      <require condition="CM33_NODSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_SP_LE_IAR">
      <description>CM33, little endian, DSP, SP FPU, IAR Compiler</description>
      <require condition="CM33_DSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="CM35P_IAR">
      <description>Cortex-M35P processor based device for the IAR Compiler</description>
      <require condition="CM35P"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_LE_IAR">
      <description>Cortex-M35P processor based device in little endian mode for the IAR Compiler</description>
      <require condition="CM35P_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="CM35P_FP_IAR">
      <description>Cortex-M35P processor based device using Floating Point Unit for the IAR Compiler</description>
      <require condition="CM35P_FP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_FP_LE_IAR">
      <description>Cortex-M35P processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <require condition="CM35P_FP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="CM35P_NODSP_NOFPU_IAR">
      <description>CM35P, no DSP, no FPU, IAR Compiler</description>
      <require condition="CM35P_NODSP_NOFPU"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_DSP_NOFPU_IAR">
      <description>CM35P, DSP, no FPU, IAR Compiler</description>
      <require condition="CM35P_DSP_NOFPU"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_NODSP_SP_IAR">
      <description>CM35P, no DSP, SP FPU, IAR Compiler</description>
      <require condition="CM35P_NODSP_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_DSP_SP_IAR">
      <description>CM35P, DSP, SP FPU, IAR Compiler</description>
      <require condition="CM35P_DSP_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_NODSP_NOFPU_LE_IAR">
      <description>CM35P, little endian, no DSP, no FPU, IAR Compiler</description>
      <require condition="CM35P_NODSP_NOFPU_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_DSP_NOFPU_LE_IAR">
      <description>CM35P, little endian, DSP, no FPU, IAR Compiler</description>
      <require condition="CM35P_DSP_NOFPU_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_NODSP_SP_LE_IAR">
      <description>CM35P, little endian, no DSP, SP FPU, IAR Compiler</description>
      <require condition="CM35P_NODSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_DSP_SP_LE_IAR">
      <description>CM35P, little endian, DSP, SP FPU, IAR Compiler</description>
      <require condition="CM35P_DSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="ARMv8MBL_IAR">
      <description>Armv8-M Baseline processor based device for the IAR Compiler</description>
      <require condition="ARMv8MBL"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MBL_LE_IAR">
      <description>Armv8-M Baseline processor based device in little endian mode for the IAR Compiler</description>
      <require condition="ARMv8MBL_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="ARMv8MML_IAR">
      <description>Armv8-M Mainline processor based device for the IAR Compiler</description>
      <require condition="ARMv8MML"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_LE_IAR">
      <description>Armv8-M Mainline processor based device in little endian mode for the IAR Compiler</description>
      <require condition="ARMv8MML_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="ARMv8MML_FP_IAR">
      <description>Armv8-M Mainline processor based device using Floating Point Unit for the IAR Compiler</description>
      <require condition="ARMv8MML_FP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_FP_LE_IAR">
      <description>Armv8-M Mainline processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <require condition="ARMv8MML_FP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="ARMv8MML_NODSP_NOFPU_IAR">
      <description>Armv8-M Mainline, no DSP, no FPU, IAR Compiler</description>
      <require condition="ARMv8MML_NODSP_NOFPU"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_DSP_NOFPU_IAR">
      <description>Armv8-M Mainline, DSP, no FPU, IAR Compiler</description>
      <require condition="ARMv8MML_DSP_NOFPU"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_NODSP_SP_IAR">
      <description>Armv8-M Mainline, no DSP, SP FPU, IAR Compiler</description>
      <require condition="ARMv8MML_NODSP_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_DSP_SP_IAR">
      <description>Armv8-M Mainline, DSP, SP FPU, IAR Compiler</description>
      <require condition="ARMv8MML_DSP_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_NODSP_NOFPU_LE_IAR">
      <description>Armv8-M Mainline, little endian, no DSP, no FPU, IAR Compiler</description>
      <require condition="ARMv8MML_NODSP_NOFPU_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_DSP_NOFPU_LE_IAR">
      <description>Armv8-M Mainline, little endian, DSP, no FPU, IAR Compiler</description>
      <require condition="ARMv8MML_DSP_NOFPU_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_NODSP_SP_LE_IAR">
      <description>Armv8-M Mainline, little endian, no DSP, SP FPU, IAR Compiler</description>
      <require condition="ARMv8MML_NODSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_DSP_SP_LE_IAR">
      <description>Armv8-M Mainline, little endian, DSP, SP FPU, IAR Compiler</description>
      <require condition="ARMv8MML_DSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <!-- conditions selecting single devices and CMSIS Core -->
    <condition id="ARMCM0 CMSIS">
      <description>Generic Arm Cortex-M0 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="ARMCM0+ CMSIS">
      <description>Generic Arm Cortex-M0+ device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM0P*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="ARMCM1 CMSIS">
      <description>Generic Arm Cortex-M1 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM1"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="ARMCM3 CMSIS">
      <description>Generic Arm Cortex-M3 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM3"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="ARMCM4 CMSIS">
      <description>Generic Arm Cortex-M4 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM4*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="ARMCM7 CMSIS">
      <description>Generic Arm Cortex-M7 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM7*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="ARMCM23 CMSIS">
      <description>Generic Arm Cortex-M23 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM23*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

